# EnableLBColumnLines

## Description
Enables/disables column lines.

```pascal
PROCEDURE EnableLBColumnLines(
				dialogID          : LONGINT;
				componentID       : LONGINT;
				enableColumnLines : BOOLEAN);
```

```python

def vs.EnableLBColumnLines(dialogID, componentID, enableColumnLines):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|dialogID|LONGINT|id of the dialog that contains the list browser|
|componentID|LONGINT|id of the list browser control|
|enableColumnLines|BOOLEAN|specifies if column lines should be drawn|

## Version
Availability: from VectorWorks11.0
## Category
* Dialogs - Modern - Browser